---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FailedToPlaceCapWarning
source: html/a313048f-52a9-ef90-eef9-16f3241705ed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FailedToPlaceCapWarning Property

Failed to place cap on the open connector.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToPlaceCapWarning { get; }
```